{
  "Agriculture": {
    "EMBEDDING -BASED RETRIEVAL WITH LLM FOR EFFECTIVE AGRICULTURE INFORMATION EXTRACTING FROM UNSTRUCTURED DATA": "Pest identification is a crucial aspect of pest control in agriculture. However, most farmers are not capable of accurately identifying pests in the field, and there is a limited number of structured data sources available for rapid querying. In this work, we explored using domain-agnostic general pre-trained large language model (LLM) to extract structured data from agricultural documents with minimal or no human intervention. We propose a methodology that involves text retrieval and filtering using embedding-based retrieval, followed by LLM question-answering to automatically extract entities and attributes from the documents, and transform them into structured data. In comparison to existing methods, our approach achieves consistently better accuracy in the benchmark while maintaining efficiency.",
    "IoT-Based Object-Detection System to Safeguard Endangered Animals and Bolster Agricultural Farm Security": "Signiﬁcant threats to ecological equilibrium and sustainable agriculture are posed by the extinction of animal species and the subsequent effects on farms. Farmers face difﬁcult decisions, such as installing electric fences to protect their farms, although these measures can harm animals essential for maintaining ecological equilibrium. To tackle these essential issues, our research introduces an innovative solution in the form of an object-detection system. In this research, we designed and implemented a system that leverages the ESP32-CAM platform in conjunction with the YOLOv8 object-detection model. Our proposed system aims to identify endangered species and harmful animals within farming environments, providing real-time alerts to farmers and endangered wildlife by integrating a cloud-based alert system. To train the YOLOv8 model effectively, we meticulously compiled diverse image datasets featuring these animals in agricultural settings, subsequently annotating them. After that, we tuned the hyperparameter of the YOLOv8 model to enhance the performance of the model. The results from our optimized YOLOv8 model are auspicious. It achieves a remarkable",
    "Importance of chat GPT in agriculture: According to chat GPT.": "ChatGPT, a powerful language model, claims to be able to  analyze data and provide actionable insights agriculture. According to it , this data  can be used for crop forecasting, soil analysis, crop disease and pest identification, precision farming and irrigation scheduling. ChatGPT states that it can be used to generate accurate and timely reports, alerts, and insights which can help businesses make more informed decisions, increase yields and improve customer service.  In this article the author explores the potential uses of chat GPT in agriculture, according to  it. The author acknowledges asking chatGPT the questions regarding its uses for agriculture. Some of the uses that it states are possible now and some are potentials for the future. The author has analyzed and edited the replies of chat GPT."
  },
  "Bio-Medical and Healthcare": {
    "ChatGPT for shaping the future of dentistry: the potential of multi-modal large language model": "The ChatGPT, a lite and conversational variant of Generative Pretrained Transformer 4 (GPT - 4) developed by OpenAI, is one of the milestone Large Language Models (LLMs) with billions of parameters. LLMs have stirred up much interest among researchers and practitioners in their impressive skills in natural language processing tasks, which profoundly impact various ﬁelds. This paper mainly discusses the future applications of LLMs in dentistry. We introduce two primary LLM deployment methods in dentistry, including automated dental diagnosis and cross - modal dental diagnosis, and examine their potential applications. Especially, equipped with a cross - modal encoder, a single LLM can manage multi - source data and conduct advanced natural language reasoning to perform complex clinical operations. We also present cases to demonstrate the potential of a fully automatic Multi - Modal LLM AI system for dentistry clinical application. While LLMs offer signiﬁcant potential beneﬁts, the challenges, such as data privacy, data quality, and model bias, need further study. Overall, LLMs have the potential to revolutionize dental diagnosis and treatment, which indicates a promising avenue for clinical application and research in dentistry.",
    "Performance of ChatGPT on USMLE: Unlocking the Potential of Large Language Models for AI-Assisted Medical Education": "Artificial intelligence is gaining traction in more ways than ever before. The popularity of language models and AI-based businesses has soared since ChatGPT was made available to the general public via OpenAI. It is becoming increasingly common for people to use ChatGPT both professionally and personally. Considering the widespread use of ChatGPT and the reliance people place on it, this study determined how reliable ChatGPT can be for answering complex medical and clinical questions. Harvard University gross anatomy along with the United States Medical Licensing Examination (USMLE) questionnaire were used to accomplish the objective. The paper evaluated the obtained results using a 2-way ANOVA and posthoc analysis. Both showed systematic covariation between format and prompt. Furthermore, the physician adjudicators independently rated the outcome's accuracy, concordance, and insight. As a result of the analysis, ChatGPT-generated answers were found to be more context-oriented and represented a better model for deductive reasoning than regular Google search results. Furthermore, ChatGPT obtained 58.8% on logical questions and 60% on ethical questions. This means that the ChatGPT is approaching the passing range for logical questions and has crossed the threshold for ethical questions. The paper believes ChatGPT and other language learning models can be invaluable tools for e-learners; however, the study suggests that there is still room to improve their accuracy. In order to improve ChatGPT's performance in the future, further research is needed to better understand how it can answer different types of questions.",
    "Domain-Specific Language Model Pretraining for Biomedical Natural Language Processing": "Pretraining large neural language models, such as BERT, has led to impressive gains on many natural language processing (NLP) tasks. However, most pretraining efforts focus on general domain corpora, such as newswire and Web. A prevailing assumption is that even domain-specific pretraining can benefit by starting from general-domain language models. In this paper, we challenge this assumption by showing that for domains with abundant unlabeled text, such as biomedicine, pretraining language models from scratch results in substantial gains over continual pretraining of general-domain language models. To facilitate this investigation, we compile a comprehensive biomedical NLP benchmark from publicly-available datasets. Our experiments show that domain-specific pretraining serves as a solid foundation for a wide range of biomedical NLP tasks, leading to new state-of-the-art results across the board. Further, in conducting a thorough evaluation of modeling choices, both for pretraining and task-specific fine-tuning, we discover that some common practices are unnecessary with BERT models, such as using complex tagging schemes in named entity recognition (NER). To help accelerate research in biomedical NLP, we have released our state-of-the-art pretrained and task-specific models for the community, and created a leaderboard featuring our BLURB benchmark (short for Biomedical Language Understanding & Reasoning Benchmark) at https://aka.ms/BLURB.",
    "Foresight - Generative Pretrained Transformer (GPT) for Modelling of Patient Timelines using EHRs": "Evidence before this study: We reviewed published evidence using Google Scholar and PubMed for studies using transformer-based models for forecasting patient timelines. We used the terms (\"transformer\" OR \"bert\" OR \"generative pretrained transformer\") AND (\"forecasting\" OR \"temporal modelling\" OR \"trajectory\") AND (\"ehr\" OR \"health records\" OR \"medical records\" OR \"healthcare\" OR \"medicine\" OR \"patients\" OR \"hospital\" OR \"clinical\"), the scope was anywhere in the text, published in 2018 or later. We found many CoVid - 19 studies, or studies that focus on a specific biomedical concept or set of concepts. A few studies focus on forecasting a wider range of biomedical concepts, but still require structured data, work with specific timeframes or can only forecast one step into the future. Added value of this study: Foresight can use unstructured and structured data, can work with different temporal resolutions (e.g. day, week, month) and because it is a generative model, in theory, it can simulate the patient's journey until death. Foresight was tested across hospitals, covering both physical and mental health, and 5 clinicians performed an independent test by simulating patients and outcomes. The tests were not focused on specific disorders or biomedical concepts but cover a broad range of concepts from the SNOMED ontology with 18 different concept types (e.g. Disorders, Substances, Findings and Procedures).",
    "A S URVEY ON GPT-3": "This paper provides an introductory survey to GPT-3. We cover some of the historical development behind this technology, some of the key features of GPT-3, and discuss the machine learning model and the datasets used. We survey both academic and commercial efforts applying GPT-3 in diverse domains such as developing conversational AI chatbots, software development, creative work, domain knowledge, and business productivity. We discuss some of the challenges that GPT-3 faces such as the problems of training complexity, bias, and hallucination/incorrect answers. We also discuss the future research opportunities in this area.",
    "Clinical XLNet: Modeling Sequential Clinical Notes and Predicting Prolonged Mechanical Ventilation": "Clinical notes contain rich data, which is unexploited in predictive modeling compared to structured data. In this work, we developed a new text representation Clinical XLNet for clinical notes which also leverages the temporal information of the sequence of the notes. We evaluated our models on prolonged mechanical ventilation prediction problem and our experiments demonstrated that Clinical XLNet outperforms the best baselines consistently.",
    "ChatGPT Utility in Healthcare Education, Research, and Practice: Systematic Review on the Promising Perspectives and Valid Concerns": "ChatGPT is an artiﬁcial intelligence (AI)-based conversational large language model (LLM). The potential applications of LLMs in health care education, research, and practice could be promising if the associated valid concerns are proactively examined and addressed. The current systematic review aimed to investigate the utility of ChatGPT in health care education, research, and practice and to highlight its potential limitations. Using the PRIMSA guidelines, a systematic search was conducted to retrieve English records in PubMed/MEDLINE and Google Scholar (published research or preprints) that examined ChatGPT in the context of health care education, research, or practice. A total of 60 records were eligible for inclusion. Beneﬁts of ChatGPT were cited in 51/60 (85.0%) records and included: (1) improved scientiﬁc writing and enhancing research equity and versatility; (2) utility in health care research (efﬁcient analysis of datasets, code generation, literature reviews, saving time to focus on experimental design, and drug discovery and development); (3) beneﬁts in health care practice (streamlining the workﬂow, cost saving, documentation, personalized medicine, and improved health literacy); and (4) beneﬁts in health care education including improved personalized learning and the focus on critical thinking and problem-based learning. Concerns regarding Chat- GPT use were stated in 58/60 (96.7%) records inc",
    "Evaluating the Feasibility of ChatGPT in Healthcare: An Analysis of\nMultiple Clinical and Research Scenarios": "This paper aims to highlight the potential applications and limits of a large language model (LLM) in healthcare. ChatGPT\nis a recently developed LLM that was trained on a massive dataset of text for dialogue with users. Although AI-based\nlanguage models like ChatGPT have demonstrated impressive capabilities, it is uncertain how well they will perform in\nreal-world scenarios, particularly in fields such as medicine where high-level and complex thinking is necessary. Furthermore, while the use of ChatGPT in writing scientific articles and other scientific outputs may have potential benefits,\nimportant ethical concerns must also be addressed. Consequently, we investigated the feasibility of ChatGPT in clinical\nand research scenarios: (1) support of the clinical practice, (2) scientific production, (3) misuse in medicine and research,\nand (4) reasoning about public health topics. Results indicated that it is important to recognize and promote education on\nthe appropriate use and potential pitfalls of AI-based LLMs in medicine.",
    "Large language model (ChatGPT) as a support tool for breast tumor board": "Large language models (LLM) such as ChatGPT have gained public and scientific attention. The aim of this study is to evaluate ChatGPT as a support tool for breast tumor board decisions making. We inserted into ChatGPT - 3.5 clinical information of ten consecutive patients presented in a breast tumor board in our institution. We asked the chatbot to recommend management. The results generated by ChatGPT were compared to the final recommendations of the tumor board. They were also graded independently by two senior radiologists. Grading scores were between 1 – 5 (1 = completely disagree, 5 = completely agree), and in three different categories: summarization, recommendation, and explanation. The mean age was 49.4, 8/10 (80%) of patients had invasive ductal carcinoma, one patient (1/10, 10%) had a ductal carcinoma in - situ and one patient (1/10, 10%) had a phyllodes tumor with atypia. In seven out of ten cases (70%), ChatGPT’s recommendations were similar to the tumor board’s decisions. Mean scores while grading the chatbot’s summarization, recommendation and explanation by the first reviewer were 3.7, 4.3, and 4.6 respectively. Mean values for the second reviewer were 4.3, 4.0, and 4.3, respectively. In this proof - of - concept study, we present initial results on the use of an LLM as a decision support tool in a breast tumor board. Given the significant advancements, it is warranted for clinicians to be familiar with the potential benefits and harms of the technology.",
    "Considering the possibilities and pitfalls of Generative Pre-trained Transformer 3 (GPT-3) in healthcare delivery": "Natural language computer applications are becoming increasingly sophisticated and, with the recent release of Generative Pre-trained Transformer 3, they could be deployed in healthcare-related contexts that have historically comprised human-to-human interaction. However, for GPT-3 and similar applications to be considered for use in health-related contexts, possibilities and pitfalls need thoughtful exploration. In this article, we briefly introduce some opportunities and cautions that would accompany advanced Natural Language Processing applications deployed in eHealth."
  },
  "Business": {
    "Temporal Data Meets LLM - Explainable Financial Time Series Forecasting": "This paper presents a novel study on harnessing Large Language Models’(LLMs) outstanding knowledge and reasoning abilities for explainable ﬁnancial time series forecasting. The application of machine learning models to ﬁnancial time series comes with several challenges, including the diﬃculty in cross - sequence reasoning and inference, the hurdle of incorporating multi - modal signals from historical news, ﬁnancial knowledge graphs, etc., and the issue of interpreting and explaining the model results. In this paper, we focus on NASDAQ - 100 stocks, making use of publicly accessible historical stock price data, company metadata, and historical economic/ﬁnancial news. We conduct experiments to illustrate the potential of LLMs in oﬀering a uniﬁed solution to the aforementioned challenges. Our experiments include trying zero - shot/few - shot inference with GPT - 4 and instruction - based ﬁne - tuning with a public LLM model Open LLaMA. We demonstrate our approach outperforms a few baselines, including the widely applied classic ARMA - GARCH model and a gradient - boosting tree model. Through the performance comparison results and a few examples, we ﬁnd LLMs can make a well - thought decision by reasoning over information from both textual news and price time series and extracting insights, leveraging cross - sequence information, and utilizing the inherent knowledge embedded within the LLM. Additionally, we show that a publicly available LLM such as Open - LLaMA, after ﬁne - tuning, can comprehend the instruction to generate explainable forecasts and achieve reasonable performance, albeit relatively inferior in comparison to GPT - 4.",
    "ChatGPT in Supply Chains: Initial Evidence of Applications and Potential Research Agenda": "Background : ChatGPT has been largely discussed since it was launched in November 2022. Problem statement: the main approaches of ChatGPT in the recent and scarce literature are more focused on the impacts for general use, applied sciences and educational systems, which evidences a relevant gap for the management ﬁeld, especially related to the supply chain area. Objectives : as a novel and initial contribution, this article aims to provide a viewpoint with the main applications and other issues regarding ChatGPT in supply chains, based on the initial discovered evidence. Methods : This viewpoint article is grounded on the few articles available in specialized magazines, blogs and company websites that approach potential applications and other issues of ChatGPT in supply chains, as a systematic literature review was not possible due to the absence of papers approaching the subject in the research databases. Contributions : this article contributes to the practitioners involved in supply chain activities who desire to have an initial and structured content related to the impacts and applications of ChatGPT on supply chains. It also seeks to encourage researchers on further research deployments in this ﬁeld by presenting potential research agenda topics. Results : ﬁrst evidence based on quality results from the analyzed content showed that, although it may take time until this technology evolves to a desirable level of maturity, it may be applied in different areas of supply chain management (e.g., route optimization, predictive maintenance, order shipment, customer and supplier relationships, data analysis, ordering process, automating invoices"
  },
  "Education": {
    "A S URVEY ON GPT-3": "This paper provides an introductory survey to GPT-3. We cover some of the historical development behind this technology, some of the key features of GPT-3, and discuss the machine learning model and the datasets used. We survey both academic and commercial efforts applying GPT-3 in diverse domains such as developing conversational AI chatbots, software development, creative work, domain knowledge, and business productivity. We discuss some of the challenges that GPT-3 faces such as the problems of training complexity, bias, and hallucination/incorrect answers. We also discuss the future research opportunities in this area.",
    "Cost-effective Selection of Pretraining Data: A Case Study of Pretraining BERT on Social Media": "Recent studies on domain-speciﬁc BERT mod- els show that effectiveness on downstream tasks can be improved when models are pre- trained on in-domain data. Often, the pre- training data used in these models are se- lected based on their subject matter, e.g., bi- ology or computer science. Given the range of applications using social media text, and its unique language variety, we pretrain two models on tweets and forum text respectively, and empirically demonstrate the effectiveness of these two resources. In addition, we investigate how similarity measures can be used to nominate in-domain pretraining data. We publicly release our pretrained models at https://bit.ly/35RpTf0.",
    "Graph-to-Tree Learning for Solving Math Word Problems": "While the recent tree-based neural models have demonstrated promising results in generating solution expression for the math word problem (MWP), most of these models do not capture the relationships and order information among the quantities well. This results in poor quantity representations and incorrect solution expressions. In this paper, we propose Graph2Tree, a novel deep learning architecture that combines the merits of the graph-based encoder and tree-based decoder to generate better solution expressions. Included in our Graph2Tree framework are two graphs, namely the Quantity Cell Graph and Quantity Comparison Graph, which are designed to address limitations of existing methods by effectively representing the relationships and order information among the quantities in MWPs. We conduct extensive experiments on two available datasets. Our experiment results show that Graph2Tree outperforms the state-of-the-art baselines on two benchmark datasets significantly. We also discuss case studies and empirically examine Graph2Tree’s effectiveness in translating the MWP text into solution expressions1.",
    "What Is the Impact of ChatGPT on Education? A Rapid Review of the Literature": "An artiﬁcial intelligence-based chatbot, ChatGPT, was launched in November 2022 and is capable of generating cohesive and informative human-like responses to user input. This rapid review of the literature aims to enrich our understanding of ChatGPT’s capabilities across subject domains, how it can be used in education, and potential issues raised by researchers during the ﬁrst three months of its release (i.e., December 2022 to February 2023). A search of the relevant databases and Google Scholar yielded 50 articles for content analysis (i.e., open coding, axial coding, and selective coding). The ﬁndings of this review suggest that ChatGPT’s performance varied across subject domains, ranging from outstanding (e.g., economics) and satisfactory (e.g., programming) to unsatisfactory (e.g., mathematics). Although ChatGPT has the potential to serve as an assistant for instructors (e.g., to generate course materials and provide suggestions) and a virtual tutor for students (e.g., to answer questions and facilitate collaboration), there were challenges associated with its use (e.g., generating incorrect or fake information and bypassing plagiarism detectors). Immediate action should be taken to update the assessment methods and institutional policies in schools and universities. Instructor training and student education are also essential to respond to the impact of ChatGPT on the educational environment.",
    "Chatting  about  ChatGPT: How may  AI and GPT impact academia and libraries ?": "This paper provides an overview of key definitions related to ChatGPT, a public tool developed by OpenAI, and its underlying technology, GPT. The paper discusses the history and technology of GPT, including its generative pre -trained transformer model, its  ability to perform a wide range of language -based tasks, and how ChatGPT utilizes this technology to function as a sophisticated chatbot. Additionally, the paper includes an interview with ChatGPT on its potential impact on academia and libraries. The interview discusses the benefits of ChatGPT such as improving search and discovery, reference and information services, cataloging and metadata generation, and content creation, as well as the ethical considerations that need to be taken into account, such as  privacy and bias. The paper also explores the possibility of using ChatGPT for writing scholarly papers."
  },
  "Social Media": {
    "The function of chat GPT in social media: According to chat GPT.": "ChatGPT is a powerful AI technology that has potential uses in social media, including customer service automation, content generation, chatbots, sentiment analysis, and data collection. While it offers many benefits, there are also some disadvantages to consider, such as its lack of empathy, potential for bias and inaccuracies, limited context awareness, difficulties in scaling, and need for human oversight. Despite these challenges, ChatGPT is still a valuable tool for businesses looking to improve their social media interactions and customer engagement."
  }
}